**Tech-Sales**
O CEO deseja otimizar as estratégias de vendas e entender melhor o desempenho da empresa em diferentes regiões.


Relatório:

Prepare um resumo com os principais insights em um formato de apresentação ou PDF.

In [252]:
import pandas as pd

tabela = pd.read_csv('simulated_sales_data.csv')
display(tabela)

,Data,Região,Produto,Quantidade,Preço Unitário,Custo Unitário,Lucro Bruto
0,2023-01-01,Norte,Fone de Ouvido,17,1036.74,656.71,6460.51
1,2023-01-01,Nordeste,Smartphone,3,2744.04,2038.45,2116.77
2,2023-01-01,Centro-Oeste,Carregador,18,3455.80,1706.20,31492.80
3,2023-01-01,Centro-Oeste,Smartphone,17,1066.14,866.72,3390.14
4,2023-01-01,Sudeste,Carregador,19,3985.68,1073.64,55328.76
...,...,...,...,...,...,...,...
3550,2024-11-30,Sul,Carregador,6,2660.64,2503.41,943.38
3551,2024-11-30,Sudeste,Mouse,1,1423.77,1191.10,232.67
3552,2024-11-30,Centro-Oeste,Notebook,17,3733.62,1990.76,29628.62
3553,2024-11-30,Centro-Oeste,Monitor,8,1565.44,359.47,9647.76
3554,2024-11-30,Norte,Notebook,8,2927.12,151.78,22202.72

In [253]:
# Rank Regiões que mais vendem

reg_vendas = tabela['Região'].unique()
# display(reg_vendas)

rank_lucro_regiao = []

for regiao in reg_vendas:
    regi = tabela.loc[tabela['Região'] == regiao]
    # display(regi)
    for tab in regi['Região'].unique():
        lucro_por_regiao = round(regi['Lucro Bruto'].sum(), 2)
        # display(f'{tab}- {round(lucro_por_regiao, 2)}')
        rank_lucro_regiao.append((tab, lucro_por_regiao))


rank_lucro_regiao.sort(key=lambda x: x[1], reverse=True)

display(rank_lucro_regiao)

[('Nordeste', 14280229.16),
 ('Norte', 14097587.09),
 ('Sudeste', 13118319.15),
 ('Sul', 12889570.89),
 ('Centro-Oeste', 12778566.78)]

In [254]:
# Produtos mais vendidos por região

regioes = tabela['Região'].unique()
# print(regioes)

for regiao in regioes:
    display(f"Região: {regiao}")
    
    # Filtrar os dados pela região atual
    dados_filtrados = tabela[tabela["Região"] == regiao]
    
    # Agrupar por produto e calcular a soma de Quantidade e Lucro Bruto
    resultado = dados_filtrados.groupby("Produto").agg(
        Quantidade_Vendida=("Quantidade", "sum"),
        Lucro_Bruto=("Lucro Bruto", "sum")
    ).reset_index()
    
    resultado_ordenado = resultado.sort_values(by="Quantidade_Vendida", ascending=False)

    # Exibir o resultado para a região atual
    display(resultado_ordenado)
    display("\n" + "="*40 + "\n")

'Região: Norte'

          Produto  Quantidade_Vendida  Lucro_Bruto
5      Smartphone                1225   2160173.18
0      Carregador                1149   2166015.44
4        Notebook                1144   2233605.49
6         Teclado                1128   2126191.15
3           Mouse                1033   2100995.30
1  Fone de Ouvido                 999   1717937.90
2         Monitor                 900   1592668.63

'\n========================================\n'

'Região: Nordeste'

          Produto  Quantidade_Vendida  Lucro_Bruto
5      Smartphone                1343   2501434.47
0      Carregador                1278   2253266.59
1  Fone de Ouvido                1093   1967517.50
3           Mouse                1087   2032516.38
6         Teclado                1033   1840524.47
2         Monitor                 984   1978584.03
4        Notebook                 952   1706385.72

'\n========================================\n'

'Região: Centro-Oeste'

          Produto  Quantidade_Vendida  Lucro_Bruto
2         Monitor                1148   1995965.23
0      Carregador                1126   2061254.69
5      Smartphone                1101   2278789.79
4        Notebook                1031   1917661.22
3           Mouse                 970   1719081.25
1  Fone de Ouvido                 871   1427158.10
6         Teclado                 791   1378656.50

'\n========================================\n'

'Região: Sudeste'

          Produto  Quantidade_Vendida  Lucro_Bruto
3           Mouse                1052   1872532.30
1  Fone de Ouvido                1028   2056918.88
4        Notebook                1020   1919449.18
6         Teclado                1009   1768334.17
5      Smartphone                1008   1846583.15
0      Carregador                 965   1788146.89
2         Monitor                 926   1866354.58

'\n========================================\n'

'Região: Sul'

          Produto  Quantidade_Vendida  Lucro_Bruto
5      Smartphone                1133   2320772.81
4        Notebook                1088   2087308.67
2         Monitor                1061   1926685.99
0      Carregador                1047   1862132.99
1  Fone de Ouvido                 922   1330019.04
3           Mouse                 906   1505470.35
6         Teclado                 902   1857181.04

'\n========================================\n'

In [255]:
# Lucro Bruto de cada Produto por Região

for regiao in regioes:
    display(f"Região: {regiao}")
    
    # Filtrar os dados pela região atual
    dados_filtrados = tabela[tabela["Região"] == regiao]
    
    # Agrupar por produto e calcular a soma de Quantidade e Lucro Bruto
    resultado = dados_filtrados.groupby("Produto").agg(
        Quantidade_Vendida=("Quantidade", "sum"),
        Lucro_Bruto=("Lucro Bruto", "sum")
    ).reset_index()
    
    resultado_ordenado = resultado.sort_values(by="Lucro_Bruto", ascending=False)

    # Exibir o resultado para a região atual
    display(resultado_ordenado)
    display("\n" + "="*40 + "\n")

'Região: Norte'

          Produto  Quantidade_Vendida  Lucro_Bruto
4        Notebook                1144   2233605.49
0      Carregador                1149   2166015.44
5      Smartphone                1225   2160173.18
6         Teclado                1128   2126191.15
3           Mouse                1033   2100995.30
1  Fone de Ouvido                 999   1717937.90
2         Monitor                 900   1592668.63

'\n========================================\n'

'Região: Nordeste'

          Produto  Quantidade_Vendida  Lucro_Bruto
5      Smartphone                1343   2501434.47
0      Carregador                1278   2253266.59
3           Mouse                1087   2032516.38
2         Monitor                 984   1978584.03
1  Fone de Ouvido                1093   1967517.50
6         Teclado                1033   1840524.47
4        Notebook                 952   1706385.72

'\n========================================\n'

'Região: Centro-Oeste'

          Produto  Quantidade_Vendida  Lucro_Bruto
5      Smartphone                1101   2278789.79
0      Carregador                1126   2061254.69
2         Monitor                1148   1995965.23
4        Notebook                1031   1917661.22
3           Mouse                 970   1719081.25
1  Fone de Ouvido                 871   1427158.10
6         Teclado                 791   1378656.50

'\n========================================\n'

'Região: Sudeste'

          Produto  Quantidade_Vendida  Lucro_Bruto
1  Fone de Ouvido                1028   2056918.88
4        Notebook                1020   1919449.18
3           Mouse                1052   1872532.30
2         Monitor                 926   1866354.58
5      Smartphone                1008   1846583.15
0      Carregador                 965   1788146.89
6         Teclado                1009   1768334.17

'\n========================================\n'

'Região: Sul'

          Produto  Quantidade_Vendida  Lucro_Bruto
5      Smartphone                1133   2320772.81
4        Notebook                1088   2087308.67
2         Monitor                1061   1926685.99
0      Carregador                1047   1862132.99
6         Teclado                 902   1857181.04
3           Mouse                 906   1505470.35
1  Fone de Ouvido                 922   1330019.04

'\n========================================\n'

In [256]:
# Produtos mais vendidos GERAL

result = tabela.groupby('Produto').agg(
    Quantidade = ('Quantidade', 'sum'),
    Lucro_Bruto = ('Lucro Bruto', 'sum')
)

print('\n POR QUANTIDADE')
display(result.sort_values(by='Quantidade', ascending=False)
)

print('\n POR LUCRO BRUTO')
display(result.sort_values(by='Lucro_Bruto', ascending=False)
)

 POR QUANTIDADE

                Quantidade  Lucro_Bruto
Produto
Smartphone            5810  11107753.40
Carregador            5565  10130816.60
Notebook              5235   9864410.28
Mouse                 5048   9230595.58
Monitor               5019   9360258.46
Fone de Ouvido        4913   8499551.42
Teclado               4863   8970887.33

 POR LUCRO BRUTO

                Quantidade  Lucro_Bruto
Produto
Smartphone            5810  11107753.40
Carregador            5565  10130816.60
Notebook              5235   9864410.28
Monitor               5019   9360258.46
Mouse                 5048   9230595.58
Teclado               4863   8970887.33
Fone de Ouvido        4913   8499551.42

In [257]:
# Por Mês

tabela['Data'] = pd.to_datetime(tabela['Data'])

# Extrair o ano e mês da coluna 'Data' para uma nova coluna 'Ano_Mês'
tabela['Ano_Mês'] = tabela['Data'].dt.to_period('M').dt.strftime('%Y-%m')  # Convertendo para string


# Agrupar os dados por 'Ano_Mês' e 'Região', e calcular as somas de Quantidade e Lucro Bruto
resultado = tabela.groupby(['Ano_Mês', 'Região']).agg(
    Quantidade_Vendida=('Quantidade', 'sum'),
    Lucro_Bruto=('Lucro Bruto', 'sum')
).reset_index()

# Exibir o resultado
display(resultado)

     Ano_Mês        Região  Quantidade_Vendida  Lucro_Bruto
0    2023-01  Centro-Oeste                 323    537015.49
1    2023-01      Nordeste                 348    519416.76
2    2023-01         Norte                 239    417348.42
3    2023-01       Sudeste                 365    814923.83
4    2023-01           Sul                 347    678471.55
..       ...           ...                 ...          ...
110  2024-11  Centro-Oeste                 255    238016.90
111  2024-11      Nordeste                 255    374582.87
112  2024-11         Norte                 254    414398.06
113  2024-11       Sudeste                 266    435493.60
114  2024-11           Sul                 314    549761.54

[115 rows x 4 columns]

In [ ]:
# Graficos

In [259]:
# RELATÓRIO FINAL